{
  "years": {
    "1918": [
      "18 жовтня – створення Української Національної Ради у Львові (законодавчий орган майбутньої ЗУНР).",
      "1 листопада – Листопадове повстання у Львові, початок українського контролю над Галичиною.",
      "9 листопада – створення уряду ЗУНР (Державного секретаріату), перший глава – Кость Левицький.",
      "13 листопада – офіційне проголошення Західноукраїнської Народної Республіки, ухвалення 'Тимчасового основного закону'.",
      "22 листопада – польські війська захопили Львів, уряд ЗУНР евакуювався до Тернополя."
    ],
    "1919": [
      "4 січня – новий уряд ЗУНР на чолі з Сидором Голубовичем.",
      "22 січня – проголошення Акту Злуки ЗУНР і УНР у Києві.",
      "червень – поразка УГА, польська окупація більшої частини Галичини."
    ],
    "1923": [
      "15 березня – Антанта офіційно визнала Східну Галичину частиною Польщі, уряд ЗУНР в еміграції припинив діяльність."
    ]
  },
  "personalities": {
    "Степан Баран": {
      "photo": "https://raw.githubusercontent.com/Mykhailo-Tr/YearBot/refs/heads/main/img/baran.jpg",
      "info": "Член Української Національної Ради, політичний діяч і журналіст."
    },
    "Євген Петрушевич": {
      "photo": "",
      "info": "Голова Української Національної Ради – законодавчого органу ЗУНР. 9 червня 1919 року став диктатором ЗУНР, отримавши повноваження одноосібного керівника. Після окупації Галичини Польщею керував урядом ЗУНР в еміграції у Відні."
    },
    "Кость Левицький": {
      "photo": "",
      "info": "Перший голова уряду (Державного Секретаріату) ЗУНР. Видатний політик, правник, один із лідерів українського національного руху в Галичині. Після захоплення Львова польськими військами подав у відставку."
    },
    "Дмитро Вітовський": {
      "photo": "",
      "info": "Організатор Листопадового повстання у Львові 1 листопада 1918 року. Державний секретар військових справ ЗУНР, один із творців Української Галицької Армії (УГА). Загинув у авіакатастрофі під час дипломатичної місії в Париж."
    },
    "Сидір Голубович": {
      "photo": "",
      "info": "Очолював уряд ЗУНР після Костя Левицького (з 4 січня 1919 року). Під час його премʼєрства відбулося обʼєднання ЗУНР з УНР (Акт Злуки 22 січня 1919 року). Після польської окупації перебував у підпіллі та еміграції."
    },
    "Лонгин Цегельський": {
      "photo": "",
      "info": "Заступник голови уряду ЗУНР, дипломат. Був одним із авторів Акту Злуки УНР і ЗУНР. Пізніше емігрував, працював у США."
    },
    "Мирон Тарнавський": {
      "photo": "",
      "info": "Головнокомандувач Української Галицької Армії (УГА). Командував у найважливіших боях."
    },
    "Олександр Греков": {
      "photo": "",
      "info": "Генерал, один із командирів УГА. Керував Чортківською офензивою 1919 року."
    }
  }
}
